[{"model": "adventure.story", "pk": 1, "fields": {"name": "Harold's House", "description": "Harold Halfthorssen was an alternative energy magnate responsible for the destruction of Asia, through his use of backstabbing trade deals and illicit war racketeering. After rendering the Asian continent a literal crater, he went on to throw lavish parties. The parties he threw served to distract people from the little baby arm growing out of his torso. As time passed, the baby arm grew to the size of a man's arm.  Doing so drained Harold's life force, and he gradually succumbed under the pressure, withering away like a silent fart. You will be trespassing his abandoned estate out of a desperate need for adventure seeking.", "first_scene": 1}}, {"model": "adventure.scene", "pk": 1, "fields": {"name": "the Entrance", "description": "Harold was an old man who liked to be sopping wet at all times. You are standing in the annex of his infamous Splash Mansion, in which many \"Wet Parties\" have been thrown for luminaries of the Minneapolis elite. You notice on the walls are stains indicating severe water damage (perhaps existing as a result the wetness of these parties) as well as elaborate portraitures of Harold's illustrious ancestors, who all look upset about something.", "story": 1, "to_scenes": [2]}}, {"model": "adventure.scene", "pk": 2, "fields": {"name": "The Staircase", "description": "The grand staircase displays itself like the seashell in the Venus de Milo paintings. You see rose petals go up and to the left, towards the West Hall. And since there's a West Hall, you're pretty sure there's an East Hall in the opposite direction.", "story": 1, "to_scenes": [3, 5]}}, {"model": "adventure.scene", "pk": 3, "fields": {"name": "the East Hall", "description": "Exquisite wainscotting lines the base of the walls. It looks like flames. The walls are a dark crimson red and on the walls are more portraits of Harold's freaky ancestors. Their eyes seem to follow you as you walk by them.", "story": 1, "to_scenes": []}}, {"model": "adventure.scene", "pk": 5, "fields": {"name": "the West Hall", "description": "Portraits of Harold's ancestors continue down the hallway. Their eyes avoid you as you pass by. You feel gauche and awkward. Rose petals continue down the hall, towards a botanical Rotunda. There are also some bedrooms labelled with printer paper on the left.", "story": 1, "to_scenes": [6, 7]}}, {"model": "adventure.scene", "pk": 6, "fields": {"name": "the Rotunda", "description": "A web of green copper extends all around this room, up to the very top of the dome, which is made of a bluish green glass. You have to assume the color of the glass though,  as the sky is inky black. The rose petals stop at a Rosebush, which is swaying rhythmically despite there being no breeze.", "story": 1, "to_scenes": []}}, {"model": "adventure.scene", "pk": 7, "fields": {"name": "Isabella's Bedroom", "description": "Harold had one daughter named Isabella. Isabella lived for about 4 years before she suddenly advanced in age and became the dynamic mad-scientist go-getter she is today. Her room is covered in a sticky orange goo that appears to originate from a large broken ceramic urn in the corner. Schematics of chemical reactions are scribbled in black marker all over the frayed wallpaper lining this room.", "story": 1, "to_scenes": [8]}}, {"model": "adventure.scene", "pk": 8, "fields": {"name": "Balcony", "description": "Exotic plants line the edge of this Balcony that reaches to the other side of the building.. The sky is completely opaque without a single star in the sky.", "story": 1, "to_scenes": [3]}}]