[{"model": "adventure.scene", "pk": 1, "fields": {"name": "the Entrance", "description": "Harold was an old man who liked to be sopping wet at all times. You are standing in the annex of his infamous Splash Mansion, in which many \"Wet Parties\" have been thrown for luminaries of the Minneapolis elite. You notice on the walls are stains indicating severe water damage (perhaps existing as a result the wetness of these parties) as well as elaborate portraitures of Harold's illustrious ancestors, who all look upset about something.", "story": 1, "to_scenes": [2]}}, {"model": "adventure.scene", "pk": 2, "fields": {"name": "The Staircase", "description": "The grand staircase displays itself like the seashell in the Venus de Milo paintings. You see rose petals go up and to the left, towards the West Hall. And since there's a West Hall, you're pretty sure there's an East Hall in the opposite direction.", "story": 1, "to_scenes": [5, 3]}}, {"model": "adventure.scene", "pk": 3, "fields": {"name": "the East Hall", "description": "Exquisite wainscotting lines the base of the walls. It looks like flames. The walls are a dark crimson red and on the walls are more portraits of Harold's freaky ancestors. Their eyes seem to follow you as you walk by them.", "story": 1, "to_scenes": [10]}}, {"model": "adventure.scene", "pk": 5, "fields": {"name": "the West Hall", "description": "Portraits of Harold's ancestors continue down the hallway. Their eyes avoid you as you pass by. You feel gauche and awkward. Rose petals continue down the hall, towards a botanical Rotunda. There are also some bedrooms labelled with printer paper on the left.", "story": 1, "to_scenes": [7, 6]}}, {"model": "adventure.scene", "pk": 6, "fields": {"name": "the Rotunda", "description": "A web of green copper extends all around this room, up to the very top of the dome, which is made of a bluish green glass. You have to assume the color of the glass though,  as the sky is inky black. The rose petals stop at a Rosebush, which is swaying rhythmically despite there being no breeze in the Greenhouse. There is also a door here that leads outside.", "story": 1, "to_scenes": [9, 11]}}, {"model": "adventure.scene", "pk": 7, "fields": {"name": "Isabella's Bedroom", "description": "Harold had one daughter named Isabella. Isabella lived for about 4 years before she suddenly advanced in age and became the dynamic mad-scientist go-getter she is today. Her room is covered in a sticky orange goo that appears to originate from a large broken ceramic urn in the corner. Schematics of chemical reactions are scribbled in black marker all over the frayed wallpaper lining this room.", "story": 1, "to_scenes": [8]}}, {"model": "adventure.scene", "pk": 8, "fields": {"name": "Balcony", "description": "Exotic plants line the edge of this Balcony that reaches to the other side of the building.. The sky is completely opaque without a single star in the sky.", "story": 1, "to_scenes": [3]}}, {"model": "adventure.scene", "pk": 9, "fields": {"name": "under the Rosebush", "description": "Ducking under the canopy you spy a tunnel that leads to a deep and wide cavern. You can't see where it ends, but you do feel a soft, pulsing breeze emitting from the void.", "story": 1, "to_scenes": []}}, {"model": "adventure.scene", "pk": 10, "fields": {"name": "the Parlor", "description": "A cobweb-ridden fireplace sits in the center of the large room, which has a bunch of old, dusty furniture facing in random directions. An old, waterlogged grand piano sits in the corner. Above the fireplace is a painted portrait of Harold himself, resplendent with a thin layer of moisture, as always. The expression on his face is stern, yet benevolent. You feel a welling in your heart, as though this room meant something to you at some point. Nonsense, of course. This is your first time here.", "story": 1, "to_scenes": []}}, {"model": "adventure.scene", "pk": 11, "fields": {"name": "the Courtyard", "description": "The air outside is still. The sky remains black and starless. However, you can still see your way around since the ground is ever so slightly radiating with a calming blue glow. Looking closer, it appears the grass itself glows in the dark. Neat. The grounds consist of a murky old pond, a large shed, and what looks like a mausoleum.", "story": 1, "to_scenes": [12, 13, 14]}}, {"model": "adventure.scene", "pk": 12, "fields": {"name": "the murky old pond", "description": "The water shimmers like obsidian against the lighting of the glowing grass.", "story": 1, "to_scenes": []}}, {"model": "adventure.scene", "pk": 13, "fields": {"name": "the Shed", "description": "A tiny wooden building made with distressed wooden planks. You notice a sign on the door that says \"TRANQUILITY ZONE\". The sign seems like it was placed here recently. The door is locked.", "story": 1, "to_scenes": []}}, {"model": "adventure.scene", "pk": 14, "fields": {"name": "the Shrine", "description": "As you approach, you realize that the mausoleum is actually an outdoor shrine. It would be a building save for the missing wall on the opposite side. There stands a statue in the middle of the space, of the Sun from those boxes of Raisin Bran scooping raisins and sprinkling them on other statues of little children who seem to enjoy it.", "story": 1, "to_scenes": []}}, {"model": "adventure.story", "pk": 1, "fields": {"name": "Harold's House", "description": "Harold Halfthorssen was an alternative energy magnate responsible for the destruction of Asia, through his use of backstabbing trade deals and illicit war racketeering. After rendering the Asian continent a literal crater, he went on to throw lavish parties. The parties he threw served to distract people from the little baby arm growing out of his torso. As time passed, the baby arm grew to the size of a man's arm.  Doing so drained Harold's life force, and he gradually succumbed under the pressure, withering away like a silent fart. You will be trespassing his abandoned estate out of a desperate need for adventure seeking.", "first_scene": 1}}, {"model": "adventure.agent", "pk": 36, "fields": {"name": "Large Rat", "description": "It is a humongous asshole, with its fangs and claws all wiggly and sharp.", "type": "EN", "attack_dmg": 66, "spc_attack_dmg": 0, "is_boss": false, "hp": 50, "mp": 5, "scene": null}}, {"model": "adventure.agent", "pk": 38, "fields": {"name": "Cannonball Bill", "description": "A hulky figure who smells like burnt blood.", "type": "EN", "attack_dmg": 100, "spc_attack_dmg": 0, "is_boss": false, "hp": 50, "mp": 3, "scene": null}}, {"model": "adventure.agent", "pk": 42, "fields": {"name": "Harold Halfthorssen", "description": "Harold faked his death by baby arm! It turns out his baby arm has only made him stronger! He is incredibly angry that you've barged into his home. End his misery once and for all!", "type": "EN", "attack_dmg": 40, "spc_attack_dmg": 0, "is_boss": true, "hp": 1000, "mp": 0, "scene": null}}, {"model": "adventure.agent", "pk": 56, "fields": {"name": "Gorilla-face", "description": "He has a tiny gorilla for a face. It is terrifying. He appears to want to eat you.", "type": "EN", "attack_dmg": 422, "spc_attack_dmg": 86, "is_boss": true, "hp": 519, "mp": 91, "scene": null}}, {"model": "adventure.agent", "pk": 269, "fields": {"name": "Reginald", "description": "Reginald was a veteran of WWII. He fails to remember this.", "type": "PLR", "attack_dmg": 0, "spc_attack_dmg": 0, "is_boss": false, "hp": 100, "mp": 10, "scene": 10}}, {"model": "adventure.move", "pk": 1, "fields": {"name": "Mild push", "description": "A mild shove is given, furthering the melee.", "type": "HP", "effect_magnitude": -3, "user": null, "special_move": false}}, {"model": "adventure.move", "pk": 2, "fields": {"name": "Pickle Bomb", "description": "A jar of pickles materializes and in an attempt to open it, the jar is broken. This causes glass and brine and pickles to burst out in all directions unpredictably.", "type": "HP", "effect_magnitude": -5, "user": null, "special_move": false}}, {"model": "adventure.move", "pk": 3, "fields": {"name": "Death Stare", "description": "The stare lessens the firepower of ones foes.", "type": "AD", "effect_magnitude": -3, "user": null, "special_move": false}}, {"model": "adventure.move", "pk": 4, "fields": {"name": "Read newspaper", "description": "Knowledge of current events is a game changer.", "type": "MP", "effect_magnitude": 2, "user": null, "special_move": false}}, {"model": "adventure.move", "pk": 5, "fields": {"name": "Belly slam", "description": "Hips are rocked with the force of 1000 moons, slamming into the opponent and causing them to poop a little bit.", "type": "HP", "effect_magnitude": -12, "user": null, "special_move": true}}, {"model": "adventure.move", "pk": 138, "fields": {"name": "Weiner Whack", "description": "A weiner dog descends from the heavens, giving the opponent a solid thwack.", "type": "HP", "effect_magnitude": -20, "user": null, "special_move": true}}, {"model": "adventure.move", "pk": 599, "fields": {"name": "Mild push", "description": "A mild shove is given, furthering the melee.", "type": "HP", "effect_magnitude": -3, "user": 269, "special_move": false}}, {"model": "adventure.move", "pk": 600, "fields": {"name": "Weiner Whack", "description": "A weiner dog descends from the heavens, giving the opponent a solid thwack.", "type": "HP", "effect_magnitude": -20, "user": 269, "special_move": true}}, {"model": "adventure.move", "pk": 601, "fields": {"name": "Pickle Bomb", "description": "A jar of pickles materializes and in an attempt to open it, the jar is broken. This causes glass and brine and pickles to burst out in all directions unpredictably.", "type": "HP", "effect_magnitude": -5, "user": 269, "special_move": false}}, {"model": "adventure.inventory", "pk": 1, "fields": {"name": "A box of pancake batter", "description": "An image of golden flapjacks adorns the cover. You pour the powder into your mouth and chew/inhale. You feel more hardy.", "type": "HP", "effect_magnitude": 10, "inventory_type": "CNS", "found_location": null, "owner": null}}, {"model": "adventure.inventory", "pk": 2, "fields": {"name": "Hearty Porridge", "description": "This porridge tastes delicious. You detect a hint of leek. This gives you more energy.", "type": "MP", "effect_magnitude": 2, "inventory_type": "CNS", "found_location": null, "owner": null}}, {"model": "adventure.inventory", "pk": 3, "fields": {"name": "Anger Juice", "description": "Anger Juice is not recommended for pregnant women and men over the age of 50.\\nDiscontinue drinking Anger Juice if you experience compulsive\\nbehaviors, hallucinations, nausea, sleepwalking, and bloody stools.\\nYou should have talked to your doctor\\nto ask if Anger Juice is right for you. After downing the shot,\\nyou feel slightly irritable.", "type": "AD", "effect_magnitude": 2, "inventory_type": "CNS", "found_location": null, "owner": null}}, {"model": "adventure.inventory", "pk": 119, "fields": {"name": "A dusty graham cracker", "description": "After blowing dust off of the graham cracker, you munch into it. It is stale but acceptable.", "type": "HP", "effect_magnitude": 2, "inventory_type": "CNS", "found_location": null, "owner": null}}, {"model": "adventure.inventory", "pk": 120, "fields": {"name": "A shot of espresso", "description": "Sipping it from the tiny cup (you are sure it's called a demitasse), you feel some bravado well up within you.", "type": "AD", "effect_magnitude": 5, "inventory_type": "CNS", "found_location": null, "owner": null}}, {"model": "adventure.inventory", "pk": 121, "fields": {"name": "Ground up monkey bones", "description": "You spit in the monkey bone powder to make a paste. You rub the paste\\non your face. It tingles. You feel more unpredictable as\\na result.", "type": "SAD", "effect_magnitude": 1, "inventory_type": "CNS", "found_location": null, "owner": null}}]